tutorials/multiRegionPlateFin/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 273;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    Wall
    {
        type            fixedValue;
        value           uniform 283;
    }
    Symmetry
    {
        type            zeroGradient;
    }
    In
    {
        type            zeroGradient;
    }
    Out
    {
        type            zeroGradient;
    }
    solid_to_fluid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        Kappa           Kappa;
        kappaMethod     solidThermo;
    }
}

// ************************************************************************* //
