tutorials/multiRegionPlateFin/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }

    rhoFinal
    {
        $rho;
    }

    p_rgh
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-12;//Was -7
        relTol           0.00001;//Was 0.01
    }

    p_rghFinal
    {
        $p_rgh;
        relTol           0;
    }

    "(U|h)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-9;//was -7
        relTol           0.001;//was .1
    }

    "(U|h)Final"
    {
        $U;
        relTol           0;
    }
}

SIMPLE
{
    momentumPredictor   yes;
}

relaxationFactors
{
    fields
    {
        rho         1;
        p_rgh       0.9;
    }

    equations
    {
        U           0.1;
        "(h|e)"     0.1;
    }
}

// ************************************************************************* //
